lisp/generic.org
* generic settings
Lots of odds and ends here. This is where they end up.
#+begin_src elisp :tangle yes
  (setq idle-update-delay 1.0)
  (add-hook 'focus-out-hook #'garbage-collect)
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right)
  (setq-default cursor-in-non-selected-windows nil)
  (setq hightlight-nonselected-windows nil)
  (setq x-stretch-cursor t)
  (setq fast-but-imprecise-scrolling t)
  (setq inhibit-compacting-font-caches t)
  (menu-bar-mode 0)
  (add-hook 'org-mode-hook 'visual-line-mode)

  ;; ID basics
  (setq user-full-name "Matthew Lemon"
        user-mail-address "matt@matthewlemon.com")

  ;; UI
  (setq inhibit-startup-message 1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (set-fringe-mode 10)

  (put 'narrow-to-defun  'disabled nil)
  (put 'narrow-to-page   'disabled nil)
  (put 'narrow-to-region 'disabled nil)

  (setq dired-recursive-copies 'always)

  (fset 'yes-or-no-p 'y-or-n-p)

  (global-auto-revert-mode)

  (setq make-backup-files nil          ; don't create backup files
        create-lockfiles nil           ; don't create lockfiles
        auto-save-default nil          ; don't auto-save to #file#
        auto-save-file-name-transforms `((".*" ,temporary-file-directory t))) ; but if auto-save is on, put it in /tmp

  (display-time-mode t)

  (setq visible-bell t)

  (setq display-line-numbers-type `relative)
  (setq undo-limit 8000000) ; raise limit to 80Mb
  (setq truncate-string-ellipsis "…") ; better than using dots
  (setq scroll-preserve-screen-position 'always) ; experimental
  (setq scroll-margin 3) ; bit of space

  ;; calendar proper Monday start
  (setq calendar-week-start-day 1)
  (setq calendar-date-style (quote european))

  ;; Handling tabs (for programming)
  (setq-default tab-width 2)
  (setq-default tab-width 2 indent-tabs-mode nil)
  (setq-default indent-tabs-mode nil)
  (setq js-indent-level 2)
  (setq css-indent-offset 2)
  (add-hook 'sh-mode-hook
            (lambda ()
              (setq sh-basic-offset 2
                    sh-indentation 2)))
  (setq web-mode-markup-indent-offset 2)

  ;; Highlight matching parens
  (show-paren-mode t)

  ;; Stop C-z suspending emacs
  (global-set-key (kbd "C-z") 'nil)

  ;; encoding
  (prefer-coding-system 'utf-8)
  (setq coding-system-for-read 'utf-8)
  (setq coding-system-for-write 'utf-8)

  (global-set-key (kbd "C-x C-l") #'toggle-truncate-lines)
  (global-set-key (kbd "C-+") #'text-scale-increase)
  (global-set-key (kbd "C--") #'text-scale-decrease)
  (global-set-key (kbd "M-n") #'forward-paragraph)
  (global-set-key (kbd "M-p") #'backward-paragraph)

  (setq calendar-latitude 55.77)
  (setq calendar-longitude -2.01)
  (setq calendar-location-name "Berwick-upon-Tweed")
#+end_src

** Some more generic stuff I got from this web site: https://emacsredux.com/blog/2026/04/07/stealing-from-the-best-emacs-configs/

*** Disable Bidirectional Text Scanning

If you don’t edit right-to-left languages (Arabic, Hebrew, etc.), Emacs is doing a bunch of work on every redisplay cycle for nothing. These settings tell Emacs to assume left-to-right text everywhere and skip the bidirectional parenthesis algorithm:

#+begin_src elisp :tangle yes
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right)
  (setq bidi-inhibit-bpa t)
#+end_src

*** Increase Process Output Buffer for LSP

The default read-process-output-max is 64KB, which is still quite conservative. Modern LSP servers like rust-analyzer or clangd routinely send multi-megabyte responses. Bumping this reduces the number of read calls Emacs has to make:

#+begin_src elisp :tangle yes
  (setq read-process-output-max (* 4 1024 1024)) ; 4MB
#+end_src

*** Redisplay fontification on input

Emacs normally fontifies (syntax-highlights) text even while you’re actively typing. This can cause micro-stutters, especially in tree-sitter modes or large buffers. One setting fixes it:

#+begin_src elisp :tangle yes
  (setq redisplay-skip-fontification-on-input t)
#+end_src

*** Don’t Render Cursors in Non-Focused Window

If you have several windows visible, Emacs draws a cursor in each of them – even the ones you’re not working in. It also highlights selections in non-focused windows. Two settings to stop that:

#+begin_src elisp :tangle yes
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)
#+end_src

*** Save the Clipboard Before Killing and No Duplicates in Kill Ring and other kill ring stuff

Allows you to copy from a web site, go back to emacs and kill a line, then you can yank from the kill ring without the thing you copied disappearing:

#+begin_src elisp :tangle yes
  (setq save-interprogram-paste-before-kill t)
  (setq kill-do-not-save-duplicates t)
#+end_src


Most configs that use savehist-mode only persist search rings. But savehist can save any variable – including the kill ring. Add it and you get clipboard history that survives restarts:

#+begin_src elisp :tangle yes
  (setq savehist-additional-variables
      '(search-ring regexp-search-ring kill-ring))
#+end_src

One thing to watch out for: the kill ring can accumulate text properties (fonts, overlays, etc.) that bloat the savehist file. Doom strips them before saving:

#+begin_src elisp :tangle yes
  (add-hook 'savehist-save-hook
            (lambda ()
  			(setq kill-ring
                    (mapcar #'substring-no-properties
                            (cl-remove-if-not #'stringp kill-ring)))))
#+end_src

*** auto-chmod scripts on save

#+begin_src elisp :tangle yes
  (add-hook 'after-save-hook
          #'executable-make-buffer-file-executable-if-script-p)
#+end_src

*** Proportional Window Resizing (Prot)

When you split a window with C-x 2 or C-x 3, Emacs halves the current window. If you already have a multi-window layout, this can produce one awkwardly tiny window while others stay large. With this setting, all windows in the frame resize proportionally:
#+begin_src elisp :tangle yes
  (setq window-combination-resize t)
#+end_src

*** Reversible C-x 1 (Purcell)

C-x 1 (delete-other-windows) is the nuclear option – it nukes your entire window layout to focus on one buffer. Then you spend the next minute recreating the layout you just destroyed.

With winner-mode and a small wrapper, you can make C-x 1 toggle: press it once to go single-window, press it again to restore the previous layout:

#+begin_src elisp :tangle yes
  (winner-mode +1)

  (defun toggle-delete-other-windows ()
    "Delete other windows in frame if any, or restore previous window config."
    (interactive)
    (if (and winner-mode
             (equal (selected-window) (next-window)))
        (winner-undo)
      (delete-other-windows)))

  (global-set-key (kbd "C-x 1") #'toggle-delete-other-windows)  
#+end_src

Just drop this into your config as-is – it’s self-contained. This is one of those tricks where once you have it, you can’t imagine going back.

*** Faster Mark Popping (Purcell, Centaur, Prot)

The mark ring is one of Emacs’s most underused navigation features. Every time you jump somewhere – isearch, M-<, M->, goto-line, imenu, and many more – Emacs pushes your old position onto the mark ring. C-u C-SPC pops it, jumping you back.

The annoyance: you need C-u C-SPC every single time. With this setting, after the first C-u C-SPC you can keep pressing just C-SPC to continue popping:
#+begin_src elisp :tangle yes
  (setq set-mark-command-repeat-pop t)  
#+end_src

This pairs beautifully with repeat-mode if you have it enabled (and you should – see my earlier post on repeat-mode).

*** Recenter After save-place Restores Position (Doom Emacs)

save-place-mode is great – it remembers where you were in each file and jumps back there when you reopen it. The problem is that it can leave your cursor on the last visible line of the window, which is disorienting. This advice recenters the view after the jump:

#+begin_src elisp :tangle yes
  (advice-add 'save-place-find-file-hook :after
              (lambda (&rest _)
                (when buffer-file-name (ignore-errors (recenter)))))
#+end_src

Small thing, but it makes reopening files feel much more natural.

*** Auto-Select Help Windows (Prot)

When you press C-h f or C-h v, Emacs opens the help buffer but leaves your cursor in the original window. You almost always want to read the help right away, so you end up pressing C-x o every single time. This fixes it:

#+begin_src elisp :tangle yes
  (setq help-window-select t)  
#+end_src

* set PATH

We need this for doing stuff in compile buffers, etc

Trying with this new config, using a package to sync the PATH:

#+begin_src elisp :tangle yes
  (use-package exec-path-from-shell
    :ensure t
    :config
    (exec-path-from-shell-initialize))
#+end_src

This was what I previously had. But not sure it worked with fish and it is much more of a hack, by the looks of it:

#+begin_src elisp :tangle yes
  ;; (defun set-exec-path-from-shell-PATH ()
  ;;   "Set up Emacs' `exec-path' and PATH environment variable to match
  ;; that used by the user's shell.

  ;; This is particularly useful under Mac OS X and macOS, where GUI
  ;; apps are not started from a shell."
  ;;   (interactive)
  ;;   (let ((path-from-shell (replace-regexp-in-string
  ;; 			                    "[ \t\n]*$" "" (shell-command-to-string
  ;; 					                                "$SHELL --login -c 'echo $PATH'"))))
  ;;     (setenv "PATH" path-from-shell)
  ;;     (setq exec-path (split-string path-from-shell path-separator))))

  ;; (set-exec-path-from-shell-PATH)
#+end_src

* remove annoying flashing stretched tabs and reset cursor to bar
#+begin_src elisp :tangle yes
  (setq x-stretch-cursor nil)
  (setq-default cursor-type 'box)
#+end_src
* recentf

We like to be able to get recent files, don't we?

#+begin_src elisp :tangle yes
(recentf-mode 1)
(setq recentf-max-menu-items 25)
(setq recentf-max-saved-items 25)
(global-set-key (kbd "C-x C-r") 'recentf-open-files)
#+end_src
* flycheck (disabled in favour of eglot and flymake)
See https://chatgpt.com/c/690268d4-4d1c-832e-9dcf-37950ba372c2 for reasons for the disabling.

#+begin_src elisp :tangle yes
  ;; (use-package flycheck
  ;; :ensure t
  ;; :hook (prog-mode . flycheck-mode)
  ;; :config
  ;; (setq flycheck-global-modes '(not org-mode))
  ;; (flycheck-add-mode 'javascript-eslint 'web-mode)
  ;; (flycheck-add-mode 'javascript-eslint 'js-ts-mode))

  (use-package flycheck
    :ensure t
    :disabled t)

  (use-package flycheck-clj-kondo
    :ensure t
    :disabled t)

    ;; (use-package
    ;; flycheck-clj-kondo
    ;; :hook (after-init . global-flycheck-mode))
#+end_src
* magit
#+begin_src elisp :tangle yes
  (use-package magit
  :ensure t
  :bind ("C-x g" . magit-status))
#+end_src
* vertico

Makes completion in the minibuffer go vertical.

#+begin_src elisp :tangle yes
    (use-package vertico
    :ensure t
    ;; (vertico-scroll-margin 0) ;; Different scroll margin
    ;; (vertico-count 20) ;; Show more candidates
    ;; (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
    ;; (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
    :init
    (vertico-mode))

  (use-package vertico-directory
    :after vertico
    :ensure nil
    :bind (:map vertico-map
                ("RET" . vertico-directory-enter)
                ("DEL" . vertico-directory-delete-char)
                ("M-DEL" . vertico-directory-delete-word))
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src
