lisp/generic.org
* save history

Persist history over Emacs restarts.

#+begin_src elisp :tangle yes
  (use-package savehist
    :init
    (savehist-mode))
#+end_src
* emacs configuration

A lot of this probably comes out of vertico to be honest.

#+begin_src elisp :tangle yes
  (use-package emacs
    :custom
    (context-menu-mode t)
    (completion-cycle-threshold 3) ;; see corfu config
    (tab-always-indent 'complete) ;; see corfu config
    (text-mode-ispell-word-completion nil) ;; see corfu config
    (read-extended-command-predicate #'command-completion-default-include-p)
    (enable-recursive-minibuffers t)
    (read-extended-command-predicate #'command-completion-default-include-p)
    (minibuffer-prompt-properties
     '(read-only t cursor-intangible t face minibuffer-prompt)))
#+end_src
* orderless

Maybe we could switch this off - not sure what it does.

#+begin_src elisp :tangle yes
  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))
#+end_src
* marginalia

Rich annotates in the minibuffer.

#+begin_src elisp :tangle yes
  (use-package marginalia
    :bind (:map minibuffer-local-map
                ("M-A" . marginalia-cycle))
    :init
    (marginalia-mode))
#+end_src
* ansi colours

Can't really remember why we need this but we do. It might be to prevent bad characters appearing in compilation mode.

#+begin_src elisp :tangle yes
  (use-package ansi-color
    :hook ((compilation-filter . ansi-color-compilation-filter)
           (shell-mode . ansi-color-for-comint-mode)))
  (add-hook 'async-shell-command-after-hook 'ansi-color-for-comint-mode)
#+end_src
* undo-tree

Turn this off if it gets too annoying.

#+begin_src elisp :tangle yes
  (use-package undo-tree
    :config
    (setq undo-tree-auto-save-history nil)
    (setq undo-tree-show-minibuffer-help t)
    (setq undo-tree-minibuffer-help-dynamic t))
#+end_src
* which-key

This is pretty good.

#+begin_src elisp :tangle yes
  (use-package which-key
  :ensure t
  :config
  (which-key-mode))
#+end_src
* multiple cursors

#+begin_src elisp :tangle yes
  (use-package multiple-cursors
  :bind (("C-S-c C-S-c" . mc/edit-lines)
         ("C->" . mc/mark-next-like-this)
         ("C-<" . mc/mark-previous-like-this)
         ("C-c C-<" . mc/mark-all-like-this)
         ("C-\"" . mc/skip-to-next-like-this)
         ("C-:" . mc/skip-to-previous-like-this)))
#+end_src
* dired-x

#+begin_src elisp :tangle yes
  (use-package dired-x
  :ensure nil
  :config
  (setq dired-omit-files
        (concat dired-omit-files "\\|^\\..+$"))
  (setq-default dired-dwim-target t)
  (setq dired-listing-switches "-alh")
  (setq dired-mouse-drag-files t))
#+end_src
* default browser
#+begin_src elisp :tangle yes
  (setq browse-url-browser-function 'eww-browse-url)
#+end_src
* corfu (currently disabled)
#+begin_src elisp :tangle yes
  ;; (use-package corfu
  ;; :ensure t
  ;; ;; Optional customizations
  ;; ;; :custom
  ;; ;; (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  ;; ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
  ;; ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
  ;; ;; (corfu-preview-current nil)    ;; Disable current candidate preview
  ;; ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
  ;; ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches

  ;; ;; Enable Corfu only for certain modes. See also `global-corfu-modes'.
  ;; :hook ((prog-mode . corfu-mode)
  ;;        (shell-mode . corfu-mode)
  ;;        (eshell-mode . corfu-mode))
  ;; :init
  ;; ;; Recommended: Enable Corfu globally.  Recommended since many modes provide
  ;; ;; Capfs and Dabbrev can be used globally (M-/).  See also the customization
  ;; ;; variable `global-corfu-modes' to exclude certain modes.
  ;; (global-corfu-mode)
  ;; ;; Enable optional extension modes:
  ;; ;; (corfu-history-mode)
  ;; ;; (corfu-popupinfo-mode)
  ;; )
#+end_src
* beacon
#+begin_src elisp :tangle yes
  (use-package beacon
  :ensure t
  :hook (prog-mode . beacon-mode))
#+end_src
* diminish
This is not essential.
#+begin_src elisp :tangle yes
  (use-package diminish
    :config
    (diminish 'completion-preview-mode)
    (diminish 'which-key-mode)
    (diminish 'beacon-mode))
#+end_src
* company
#+begin_src elisp :tangle yes
  ;; For revision see https://chatgpt.com/c/690268d4-4d1c-832e-9dcf-37950ba372c2
  (use-package company
    :ensure t
    :hook (prog-mode . company-mode)
    :config
    (setq company-backends '(company-capf))
    (setq company-idle-delay 0.2
          company-minimum-prefix-length 2
          company-show-numbers t
          company-global-modes '(not org-mode)))

  (with-eval-after-load 'company
    (setq company-backends '(company-capf))
    ;; Optional: TAB triggers completion at point in prog buffers
    (define-key prog-mode-map (kbd "TAB") #'completion-at-point))

  (with-eval-after-load 'completion-preview
    ;; Show the preview already after two symbol characters
    (setq completion-preview-minimum-symbol-length 2)

    ;; Non-standard commands to that should show the preview:

    ;; Org mode has a custom `self-insert-command'
    (push 'org-self-insert-command completion-preview-commands)
    ;; Paredit has a custom `delete-backward-char' command
    (push 'paredit-backward-delete completion-preview-commands)

    ;; Bindings that take effect when the preview is shown:

    ;; Cycle the completion candidate that the preview shows
    (keymap-set completion-preview-active-mode-map "M-n" #'completion-preview-next-candidate)
    (keymap-set completion-preview-active-mode-map "M-p" #'completion-preview-prev-candidate)
    ;; Convenient alternative to C-i after typing one of the above
    )
#+end_src
