lisp/generic.el

(use-package savehist
  :init
  (savehist-mode))

(use-package emacs
  :custom
  (context-menu-mode t)
  (completion-cycle-threshold 3) ;; see corfu config
  (tab-always-indent 'complete) ;; see corfu config
  (text-mode-ispell-word-completion nil) ;; see corfu config
  (read-extended-command-predicate #'command-completion-default-include-p)
  (enable-recursive-minibuffers t)
  (read-extended-command-predicate #'command-completion-default-include-p)
  (minibuffer-prompt-properties
   '(read-only t cursor-intangible t face minibuffer-prompt)))

(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))

(use-package marginalia
  :bind (:map minibuffer-local-map
              ("M-A" . marginalia-cycle))
  :init
  (marginalia-mode))

(use-package ansi-color
  :hook ((compilation-filter . ansi-color-compilation-filter)
         (shell-mode-hook . ansi-color-for-comint-mode)))
(add-hook 'async-shell-command-after-hook 'ansi-color-for-comint-mode)

(use-package undo-tree
  :config
  (setq undo-tree-auto-save-history nil)
  (setq undo-tree-show-minibuffer-help t)
  (setq undo-tree-minibuffer-help-dynamic t))

(use-package which-key
:ensure t
:config
(which-key-mode))

(use-package multiple-cursors
:bind (("C-S-c C-S-c" . mc/edit-lines)
       ("C->" . mc/mark-next-like-this)
       ("C-<" . mc/mark-previous-like-this)
       ("C-c C-<" . mc/mark-all-like-this)
       ("C-\"" . mc/skip-to-next-like-this)
       ("C-:" . mc/skip-to-previous-like-this)))

(use-package dired-x
:ensure nil
:config
(setq dired-omit-files
      (concat dired-omit-files "\\|^\\..+$"))
(setq-default dired-dwim-target t)
(setq dired-listing-switches "-alh")
(setq dired-mouse-drag-files t))

(setq browse-url-browser-function 'eww-browse-url)

(use-package corfu
:ensure t
;; Optional customizations
;; :custom
;; (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
;; (corfu-preview-current nil)    ;; Disable current candidate preview
;; (corfu-preselect 'prompt)      ;; Preselect the prompt
;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches

;; Enable Corfu only for certain modes. See also `global-corfu-modes'.
:hook ((prog-mode . corfu-mode)
       (shell-mode . corfu-mode)
       (eshell-mode . corfu-mode))
:init
;; Recommended: Enable Corfu globally.  Recommended since many modes provide
;; Capfs and Dabbrev can be used globally (M-/).  See also the customization
;; variable `global-corfu-modes' to exclude certain modes.
(global-corfu-mode)
;; Enable optional extension modes:
;; (corfu-history-mode)
;; (corfu-popupinfo-mode)
)

(use-package beacon
:ensure t
:hook (prog-mode . beacon-mode))

(use-package diminish
  :config
  (diminish 'completion-preview-mode)
  (diminish 'which-key-mode)
  (diminish 'beacon-mode))

(use-package company
  :ensure t
  :hook (prog-mode . company-mode)
  :config
  (setq company-idle-delay 0.2
        company-minimum-prefix-length 2
        company-show-numbers t
        company-dabbrev-downcase nil
        company-dabbrev-ignore-case nil
        company-dabbrev-code-ignore-case nil
        company-global-modes '(not org-mode)))

(with-eval-after-load 'completion-preview
  ;; Show the preview already after two symbol characters
  (setq completion-preview-minimum-symbol-length 2)

  ;; Non-standard commands to that should show the preview:

  ;; Org mode has a custom `self-insert-command'
  (push 'org-self-insert-command completion-preview-commands)
  ;; Paredit has a custom `delete-backward-char' command
  (push 'paredit-backward-delete completion-preview-commands)

  ;; Bindings that take effect when the preview is shown:

  ;; Cycle the completion candidate that the preview shows
  (keymap-set completion-preview-active-mode-map "M-n" #'completion-preview-next-candidate)
  (keymap-set completion-preview-active-mode-map "M-p" #'completion-preview-prev-candidate)
  ;; Convenient alternative to C-i after typing one of the above
)
